"Western (Mac OS Roman)" = "Phía Tây (Mac OS Roman)";
"Japanese (Mac OS)" = "Tiếng Nhật (Mac OS)";
"Traditional Chinese (Mac OS)" = "Tiếng Trung Phồn thể (Mac OS)";
"Korean (Mac OS)" = "Tiếng Hàn (Mac OS)";
"Arabic (Mac OS)" = "Ả rập (Mac OS)";
"Hebrew (Mac OS)" = "Tiếng Hebrew (Mac OS)";
"Greek (Mac OS)" = "Tiếng Hy Lạp (Mac OS)";
"Cyrillic (Mac OS)" = "Tiếng Kirin (Mac OS)";
"Devanagari (Mac OS)" = "Devanagari (Mac OS)";
"Gurmukhi (Mac OS)" = "Tiếng Gurmukhi (Mac OS)";
"Gujarati (Mac OS)" = "Gujarat (Mac OS)";
"Thai (Mac OS)" = "Tiếng Thái (Mac OS)";
"Simplified Chinese (Mac OS)" = "Tiếng Trung Giản thể (Mac OS)";
"Tibetan (Mac OS)" = "Tiếng Tây Tạng (Mac OS)";
"Central European (Mac OS)" = "Trung Âu (Mac OS)";
"Symbol (Mac OS)" = "Ký hiệu (Mac OS)";
"Dingbats (Mac OS)" = "Dingbats (Mac OS";
"Turkish (Mac OS)" = "Tiếng Thổ Nhĩ Kỳ (Mac OS)";
"Croatian (Mac OS)" = "Tiếng Croatia (Mac OS)";
"Icelandic (Mac OS)" = "Tiếng Iceland (Mac OS)";
"Romanian (Mac OS)" = "Tiếng Rumani (Mac OS)";
"Celtic (Mac OS)" = "Celtic (Mac OS)";
"Gaelic (Mac OS)" = "Tiếng Gaelic (Mac OS)";
"Keyboard Symbols (Mac OS)" = "Ký hiệu Bàn phím (Mac OS)";
"Farsi (Mac OS)" = "Tiếng Farsi (Mac OS)";
"Cyrillic (Mac OS Ukrainian)" = "Tiếng Kirin (Mac OS Ukrainian)";
"Inuit (Mac OS)" = "Inuit (Mac OS)";
"Unicode (UTF-16)" = "Unicode (UTF-16)";
"Unicode (UTF-7)" = "Unicode (UTF-7)";
"Unicode (UTF-8)" = "Unicode (UTF-8)";
"Unicode (UTF-32)" = "Unicode (UTF-32)";
"Unicode (UTF-16BE)" = "Unicode (UTF-16BE)";
"Unicode (UTF-16LE)" = "Unicode (UTF-16LE)";
"Unicode (UTF-32BE)" = "Unicode (UTF-32BE)";
"Unicode (UTF-32LE)" = "Unicode (UTF-32LE)";
"Western (ISO Latin 1)" = "Phía Tây (ISO Latin 1)";
"Central European (ISO Latin 2)" = "Trung Âu (ISO Latin 2)";
"Western (ISO Latin 3)" = "Phía Tây (ISO Latin 3)";
"Central European (ISO Latin 4)" = "Trung Âu (ISO Latin 4)";
"Cyrillic (ISO 8859-5)" = "Tiếng Kirin (ISO 8859-5)";
"Arabic (ISO 8859-6)" = "Ả rập (ISO 8859-6)";
"Greek (ISO 8859-7)" = "Tiếng Hy Lạp (ISO 8859-7)";
"Hebrew (ISO 8859-8)" = "Tiếng Hebrew (ISO 8859-8)";
"Turkish (ISO Latin 5)" = "Tiếng Thổ Nhĩ Kỳ (ISO Latin 5)";
"Nordic (ISO Latin 6)" = "Tiếng Bắc Âu (ISO Latin 8)";
"Thai (ISO 8859-11)" = "Tiếng Thái (ISO 8859-11)";
"Baltic (ISO Latin 7)" = "Baltic (ISO Latin 7)";
"Celtic (ISO Latin 8)" = "Celtic (ISO Latin 8)";
"Western (ISO Latin 9)" = "Phía Tây (ISO Latin 9)";
"Romanian (ISO Latin 10)" = "Tiếng Rumani (ISO Latin 10)";
"Latin-US (DOS)" = "Tiếng La Tinh-US (DOS)";
"Greek (DOS)" = "Tiếng Hy Lạp (DOS)";
"Baltic (DOS)" = "Baltic (DOS)";
"Western (DOS Latin 1)" = "Phía Tây (DOS Latin 1)";
"Greek (DOS Greek 1)" = "Tiếng Hy Lạp (DOS Greek 1)";
"Central European (DOS Latin 2)" = "Trung Âu (DOS Latin 2)";
"Cyrillic (DOS)" = "Tiếng Kirin (DOS)";
"Turkish (DOS)" = "Tiếng Thổ Nhĩ Kỳ (DOS)";
"Portuguese (DOS)" = "Tiếng Bồ Đào Nha (DOS)";
"Icelandic (DOS)" = "Tiếng Iceland (DOS)";
"Hebrew (DOS)" = "Tiếng Hebrew (DOS)";
"Canadian French (DOS)" = "Tiếng Pháp ở Canada (DOS)";
"Arabic (DOS)" = "Ả rập (DOS)";
"Nordic (DOS)" = "Tiếng Bắc Âu (DOS)";
"Russian (DOS)" = "Tiếng Nga (DOS)";
"Greek (DOS Greek 2)" = "Tiếng Hy Lạp (DOS Greek 2)";
"Thai (Windows, DOS)" = "Tiếng Thái (Windows, DOS)";
"Japanese (Windows, DOS)" = "Tiếng Nhật (Windows, DOS)";
"Simplified Chinese (Windows, DOS)" = "Tiếng Trung Giản thể (Windows, DOS)";
"Korean (Windows, DOS)" = "Tiếng Hàn (Windows, DOS)";
"Traditional Chinese (Windows, DOS)" = "Tiếng Trung Phồn thể (Windows, DOS)";
"Western (Windows Latin 1)" = "Phía Tây (Windows Latin 1)";
"Central European (Windows Latin 2)" = "Trung Âu (Windows Latin 2)";
"Cyrillic (Windows)" = "Tiếng Kirin (Windows)";
"Greek (Windows)" = "Tiếng Hy Lạp (Windows)";
"Turkish (Windows Latin 5)" = "Tiếng Thổ Nhĩ Kỳ (Windows Latin 5)";
"Hebrew (Windows)" = "Tiếng Hebrew (Windows)";
"Arabic (Windows)" = "Ả rập (Windows)";
"Baltic (Windows)" = "Baltic (Windows)";
"Vietnamese (Windows)" = "Tiếng Việt (Windows)";
"Western (ASCII)" = "Phía Tây (ASCII)";
"Japanese (Shift JIS X0213)" = "Tiếng Nhật (Shift JIS X0213)";
"Chinese (GBK)" = "Tiếng Trung (GBK)";
"Chinese (GB 18030)" = "Tiếng Trung (GB 18030)";
"Japanese (ISO 2022-JP)" = "Tiếng Nhật (ISO 2022-JP)";
"Japanese (ISO 2022-JP-2)" = "Tiếng Nhật (ISO 2022-JP-2)";
"Japanese (ISO 2022-JP-1)" = "Tiếng Nhật (ISO 2022-JP-1)";
"Chinese (ISO 2022-CN)" = "Tiếng Trung (ISO 2022-CN)";
"Korean (ISO 2022-KR)" = "Tiếng Hàn (ISO 2022-KR)";
"Japanese (EUC)" = "Tiếng Nhật (EUC)";
"Simplified Chinese (GB 2312)" = "Tiếng Trung Giản thể (GB 2312)";
"Traditional Chinese (EUC)" = "Tiếng Trung Phồn thể (EUC)";
"Korean (EUC)" = "Tiếng Hàn (EUC)";
"Japanese (Shift JIS)" = "Tiếng Nhật (Shift JIS)";
"Cyrillic (KOI8-R)" = "Tiếng Kirin (KOI8-R)";
"Traditional Chinese (Big 5)" = "Tiếng Trung Phồn thể (Big 5)";
"Western (Mac Mail)" = "Phía Tây (Mac Mail)";
"Simplified Chinese (HZ GB 2312)" = "Tiếng Trung Giản thể (HZ GB 2312)";
"Traditional Chinese (Big 5 HKSCS)" = "Tiếng Trung Phồn thể (Big 5 HKSCS)";
"Ukrainian (KOI8-U)" = "Tiếng Ukraina (KOI8-U)";
"Traditional Chinese (Big 5-E)" = "Tiếng Trung Phồn thể (Big 5-E)";
"Western (NextStep)" = "Phía Tây (NextStep)";
"Non-lossy ASCII" = "ASCII không tổn hao";
"Western (EBCDIC Latin Core)" = "Phía Tây (EBCDIC Latin Core)";
"Western (EBCDIC Latin 1)" = "Phía Tây (EBCDIC Latin 1)";
"Japanese (Auto Detect)" = "Tiếng Nhật (Tự Phát hiện)";
